{"pageProps":{"postData":{"filename":"02makeSheet","title":"02表を作ってみよう","topics":[],"article":"\n# はじめに\n\n今回は、実際に表計算ソフト使って見ましょう。\nこの連載では、google spreadsheetを使っていきます。\nexcelを利用したいという人も基本的に、操作は似ているので参考にできると思います。\nちなみに、使用するブラウザはchromeを想定しています。\n\n今回は、表を作ってみます。\n初めに、google spreadsheetの開き方、画面の説明、終わり方を説明します。\nその後、表を作るための基本的な機能と、その使い方を紹介します。\n最後に、例を作ってみせます。\n\n# google spreadsheet\n\n## 開き方\ngoogle spreadsheetは開き方を2つ紹介します。\n\ngoogle spreadsheetはgoogleのアカウントでログインしたchromeなら簡単に開くことができます。\n\n### 開き方１\n\nchromeを開いた最初のページの、右上にある9つの点をクリックします。\n\nそうするとアプリ一覧が出てきて、その中にスプレッドシートがあるので、それをクリックして開きます。\n\n「新しいスプレッドシートを作成」の中の「空白」から、スプレッドシートを開くことができます。\n\n### 開き方２\n次にGドライブ上での開き方です。\n\nGドライブ上の任意のフォルダーを開いた状態で、左上の新規をクリックします。\n\n開いたメニューの中からGoogleスプレッドシートをクリックします。\n\n## 画面の説明\n\n次に画面の説明をしましょう。\n\n一番上がファイル名です。ファイル名をクリックすることで、編集モードになり、ファイル名を変更できます。\n\nその下が、「ファイル」や「編集」などスプレッドシート全般の操作に関するメニューの一覧が並んだメニューバーです。\n\nさらにその下に、以降で説明するセルなどを編集する機能をまとめたメニューバーがあります。\n\nそして画面の大部分を占めているのが、セルと呼ばれるものです。このセルにさまざま値を入力して、表を作成します。\nセルは、行方向の番号と、列方向のアルファベットで指定します。\nたとえば、今クリックしたセルは、`D3`ということになります。\nこれを **セル番地** と言います。\nある一定の範囲を指定する場合は、`D3:F7`というようにして指定します。\nこれらは、選択した時に、左上にも表示されます。\n\n\n左下にシートがあります。最初は`シート１`という名前が付けられていますが、ダブルクリックすることで、名前を変更することもできます。\nまた、隣のプラスマークを押すことで、シートを増やすこともできます。\n\n## 終わり方\n\n終わり方は、簡単です。\nGoogle spreadsheetは自動保存になっているので、そのままタブを閉じるだけで、終了できます。\n\n# 表を作るための基本的な機能\n\n次に、表を作るための基本的は機能を説明します。\n\n## 文字の入力\n\n文字の入力は簡単です。\n文字を入力したいセルをクリックして選択状態にし、任意の文字や数値を入力してください。\n入力が完了したら、`Enter`または`Return`を押すことで次のセルに移動できます。\n\n選択するセルはクリックする以外に、矢印キーでも選ぶことができます。\n\n`Shift + 矢印キー`で範囲選択をできます。\n`Ctrl + 矢印キー`で最後のセルに移動できます。\n\nまた、オートフィルという機能があります。\nこれは、いくつか値を入力して、入力した範囲を選択します。\n枠の右下の四角をドラッグして伸ばすと、入力された値から規則性を読み取り、以降の値を自動で入力してくれます。\n\nこういった機能は、入力を楽にしてくれるので、どんどん使っていきましょう。\n\n## 文字の装飾\n\n入力された文字は、文章作成ソフトなどと同様に、フォントを変えたり、文字の大きさを変えたりできます。\n\nこのような操作は上のメニューバーから行います。\nホバーすると、名前が出てくるので、わかりやすいですね。\n\nさらに、太字・斜体・取り消し線などの表現も可能です。\n\nまた、文字の色も変えることができます。\n\n## 文字の表示形式\n\n表計算ソフトでは、計算をさせることができます。\nたとえば、消費税の計算をさせたい場合を考えてみましょう。\nここで、問題になるのは、消費税率をどのように入力するかです。\n0.1と入力すると、税込み価格の計算は簡単なかけ算でできますが、0.1という表記は人間には直感的ではありません。\nつまり、わかりにくいですね。\nかといって、10と入力すると、計算がややこしくなります。\n\nこのような問題に対処できるのが、表示形式です。\n0.1と入力してメニューバーのパーセントを押すと10%の表示になります。\n\n円マークをつけることもできます。お金を扱う資料を作る際には便利ですね。\n\n小数点の桁数を揃えることもできます。\n\n他にも日付や時刻表示なども、ある程度細かく設定できます。\n\n## 文字の配置や折り返し\n\n文字は、文章作成ソフトと同様に、左寄せ・中央寄せ・右寄せを選択できます。\n\n上下方向に関しても、上寄せ・中央寄せ・下寄せを選択できます。\n\nセルからはみ出した分の文字についても、はみ出す・切り詰める・折り返すから選択できます。\n\n## セルのサイズ変更\n\nセルのサイズを変更できます。\n\n行方向の数値や列方向のアルファベットが書いてあるセルの、セルとセルの間にカーソルを合わせてドラッグすることで、セルの任意のサイズに変更できます。\n\nこのように、数値やアルファベットの書いてあるセルを、ドラッグして複数を選択したり、\n\n左上角のセルをクリックして全体を選択し、\n\n一気に変更することもできます。\n\n## セルの結合\n\nセルを結合できます。\n\n結合したいセルを選んで、メニューバーの結合をクリックするだけです。\n\n## セルの罫線\n\n表を作るときは、線を引く必要があります。\nこのように表の中で、区切りや囲みに用いられる線を **罫線** と言います。\nGoogle spreadsheetでは、罫線を引きたいセルを選択して、メニューバーから罫線をクリックします。\n\n線の色と線の種類を先に選択します。\nそしたら、罫線を引く場所をクリックすることで、罫線をひくことができます。\n\n## セルの塗りつぶし\n\nセルの塗りつぶしは、塗りつぶしたいセルを選択して、メニューバーからバケツをクリックします。\n\n塗りつぶしたい色をクリックすることで、塗りつぶすことができます。\n\n## 条件付き書式\n\n入力された値をもとに、文字の色を変えたり、塗りつぶしたりしたい時があります。\nたとえば、教師は赤点の生徒には関心があります。「赤点の生徒の点数だけ、値を赤にして目立たせたい」といった操作をしたい時がしばしばあります。\nそのようなとき、 **条件付き書式** が有効です。\n\n条件付き書式を設定したいセルを選択し、メニューバーのテキストの色か塗りつぶしをクリックします。\n下の方にある条件付き書式をクリックすると、右のサイドバーにメニューが表示されます。\n書式のルールと書式設定を入力して完了をクリックすることで条件付き書式を設定できます。\n\n# 表を作ってみよう\n\n# まとめ\n\n今回は、google spreadsheetを通して表計算ソフトの使い方の基本を学んできました。\nたくさん紹介したので、この動画を見直して復習してみてください。\n\nまた、このようなソフトは「習うより慣れろ」です。\n説明を聞くより、いろいろ操作してみた方が、使いこなせるようになります。\nそれに、この動画だけでは、すべての機能を紹介することはできません。\nいろいろ触って操作してみて、学びを深めていってほしいです。","date":"2022/3/6 17:14:00","category":"over-the-fence","published":false}},"__N_SSG":true}