{"pageProps":{"postData":{"filename":"03useFunction","title":"03関数で計算をさせてみよう","topics":[],"article":"\n# はじめに\n\n今回も、実際に表計算ソフト使って見ましょう。\nこの連載では、google spreadsheetを使っていきます。\nexcelを利用したいという人も基本的に、操作は似ているので参考にできると思います。\nちなみに、使用するブラウザはchromeを想定しています。\n\n今回は、計算式や関数を使って計算を行います。。\n初めに、簡単な四則演算の説明をし、\n次に関数を使った計算及び処理について説明します。\n\n# まず計算をさせてみよう\n\n表計算ソフトのほとんどは、数学で扱うような計算式を書くことで、計算をさせることが出来ます。\nルールとしては、イコールから書き始めることくらいです。\n\nまた、計算に使用する演算子も、日頃使っているものと違う部分があるので注意してください。\n演算子とは、計算の際に書く「＋, ー, ×, ÷」といった記号のことです。\n\n|演算名|表計算ソフトで使用する演算子|\n|----|:--:|\n|加算|+|\n|減算|-|\n|乗算|*|\n|除算|/|\n|べき乗|^|\n|余り|%|\n\n実際に使うとこんな感じです。\n通常の計算で使用する計算式とほとんど変わらないですね。\n\nまた、計算式入力の際にセルをクリックすることで、そのセルに入力されている値を参照することも出来ます。\nこれは、値を書き換えた時に自動的に計算もやり直してくれるので便利です。\n\n## 相対参照\n\n計算の際にセルを参照をすると、その式をコピーして別の場所に貼り付けた際に、参照場所もそれに合わせて移動した分だけ移動してくれます。\n\nこれによって同じ計算の場合は、いちいち計算式を書く必要がなく、コピペだけで済ませることが出来ます。\n\nこれは、計算式を移動させたことで、相対的に参照場所も移動する参照なので、 **相対参照** と言われます。\n\n## 絶対参照\n\n一方で、このように参照場所が動いてほしくない時もあります。\n\nそのときは、参照するセルのセル番地に$(ドルマーク)をつけます。\n列方向を固定したいときは、アルファベットに、行方向を固定したいときは、数値の前にドルマークをつけます。\n両方固定したい場合は、両方につけます。\n\nこのように、計算式を移動させても、参照場所は絶対位置で動かない参照のことを **絶対参照** と言います。\n\n相対参照と絶対参照は、うまく使うと効率的に表を作ることが出来ます。\n\n# 関数とは\n\nここからは、関数について見ていきましょう。\nここまでに紹介した計算式は、合計や平均など複雑な計算をさせようと思うと、式が長く繁雑になってしまいます。\n\nそこで登場するのが関数です。\n\n関数は、合計や平均など、何かしらの機能を簡単に書くための仕組みです。\n\n関数は、関数名と引数を指定することで、さまざまな処理を行わせることが出来ます。\n\n関数名で、合計を求めるのか、平均を求めるのか、はたまた、30点以上の生徒の人数を求めるのか、といった行いたい処理を指定します。\n\n引数では、その処理に必要な値を指定します。例えば、合計を求めたい場合は、合計を求めるための値がどこに入力されているかを指定する必要があります。\nその時に使うのが引数です。\n必要な引数の数は、関数によって異なります。\n\n関数の書き方は、このようになります。\n計算式と同様にイコールから始めて、関数名、括弧して中に必要な分だけ引数を書きます。\n\n```xlsx:関数の例\n=関数名(引数1, 引数2, ...)\n```\n\n関数の形はイメージがついたと思いますので、残りは実際の関数を書いて理解を深めていきましょう。\n\n# 関数を使ってみよう\n\n## SUM関数\n\nSUM関数は合計を求める関数で、このように書きます。\n\n```xlsx:SUM関数\n=SUM(範囲)\n```\n\n`範囲`には、合計を求める範囲のセル番地を入力します。\n実際の例だと、このように書きます。\n\n## AVERAGE関数\n\nAVERAGE関数は平均を求める関数で、このように書きます。\n\n```xlsx:AVERAGE関数\n=AVERAGE(範囲)\n```\n\n`範囲`には、平均を求める範囲のセル番地を入力します。\n実際の例だと、このように書きます。\n\n## COUNT関数\n\nCOUNT関数は数値が入力されているセルの数を求める関数で、このように書きます。\n\n```xlsx:COUNT関数\n=COUNT(範囲)\n```\n\n`範囲`には、数値が入力されているセルの数を求める範囲の、セル番地を入力します。\n\nアンケートでの未回答者の数や、試験を受けた生徒の数を求める際に利用します。\n実際の例だと、このように書きます。\n\n## MID関数\n\nMID関数は文字列のa番目の文字からb文字分を取り出す関数で、このように書きます。\n\n```xlsx:MID関数\n=MID(文字列, a, b)\n```\n\n`文字列`にはセル番地を指定しても構いません。\n\n実際の例だと、このように書きます。この例だと、３文字目から２文字分を取り出しています。\n\n## IF関数\n\nIF関数は、少し複雑です。\n\n英語で`If xxx, yyy.`という「もしxxxだったら、yyyなのに。」という文を習ったと思います。\n\nそれと同じで、IF関数は、条件が成り立てばこれ、そうでなければこれ、といったふうに処理を分けることができる関数で、このように書きます。\n\n```xlsx:IF関数\n=IF(論理式, 真の時の処理, 偽の時の処理)\n```\n\n論理式とは、計算結果が正しい(TRUE)か正しくない(FALSE)のみの式です。\n例えば、論理式には、`点数 < 30`があります。これは`点数=25`のときは、正しい(TRUE)。\nしかし、`点数=87`のときは正しくない(FALSE)。\nそして、これ正しい、または、正しくないのどちらかにしたなりません。\nこのようなものが論理式になります。\n\n```mermaid\ngraph TB\nA{論理式} --TRUE--> B[真の時の処理]\nA{論理式} --FALSE--> C[偽の時の処理]\n```\n\n論理式は、次のようなものがあります。\n\n|論理式|意味|\n|----|----|\n|A > B|AはBよりも大きい|\n|A >= B|AはB以上|\n|A < B|AはBよりも小さい|\n|A <= B|AはB以下|\n|A = B|AはBと等しい|\n|A <> B|AとBは等しくない|\n\nA, Bにはセル番地が入ったり、直接的な値が入ったりします。\n\nそして、この論理式がTRUEのとき、真の時の処理が実行されます。\n真の時の処理とは、具体的に表示したい値や、計算させたい関数などを書きます。\n\n論理式がFALSEのとき、偽の時の処理が実行されます。\n偽の時の処理も同様に、具体的に表示したい値や、計算させたい関数などを書きます。\n\n実際の例だと、このように書きます。\nこの例だと、参照したセル番地にある点数が30点以上ならば合格、そうでないならば不合格と表示しています。\n\n```mermaid\ngraph TB\nA{点数 > 30} --TRUE--> B[合格]\nA{点数 > 30} --FALSE--> C[不合格]\n```\n\n## VLOOKUP関数\n\nVLOOKUP関数も複雑です。が使い所が多く、便利な関数なので紹介します。\n\nたいていの表の場合、列方向にそれぞれの項目があり、行方向にそれぞれのデータが入力されています。\n\n|生徒名|国語|数学|英語|合計|\n|----|----|----|----|----|\n|A|56|87|62|205|\n|B|92|43|80|175|\n|C|23|45|40|108|\n\nこれらのデータから、お目当てのデータを探す時に、何行目のデータか、と縦方向(Vertical)に探していきます。\nこの縦方向にデータを探す関数がVLOOKUP関数です。\n\n```xlsx:VLOOKUP関数\n=VLOOKUP(検索キー, 範囲, 指数, [並べ替え済み])\n```\n\n- 検索キーには、検索する値が入ります。例えば、Bさんを見つけたい場合は、Bが入ります。\n- 範囲は、探すデータを含むセル番地の範囲が入ります。\n- 指数には、値を返す列が入ります。数学の点数を返して欲しければ、範囲の中で３列目なので、3を入力します。\n- 並べ替え済みは、わかりにくいですが、TRUEかFALSEを指定します。TRUEを指定した場合、検索キーに近い値のデータを取得します。FALSEに指定した場合は、検査キーと完全に一致した値を取得します。この引数は省略することができ、その場合は、TRUEが指定されます。基本的にはFALSEを指定した方がいいでしょう。\n\n引数に指定する要素が多いので、例を見て理解を深めましょう。\n\n\n## 関数の組み合わせ\n\n関数は、組み合わせることで、より複雑な処理をさせることも出来ます。\n\nここでは、次のような例をもとに、IF関数とSUM関数を組み合わせた例を紹介します。\n\nこの例では、以前とったイベントの希望調査の表の例を使いましょう。\nどのイベントを希望するかの調査を昔表にまとめていたが、最近になって、調査し直したら希望しない人が出てきたシチュエーションです。\nこのような場合、最終希望に◯が付いている人だけ、合計支払い金額を求め、それ以外の人は、空欄になるような処理が必要になります。\nそれを、関数を使って実現しましょう。\n\n\n\nここで見せたのは、一例です。このように引数に、関数を書くこともできるので、発想次第で、色々な処理をさせることが出来ます。\nただし、組み合わせ過ぎると、後から見直した時に、何を書いているかわからない可読性の低いものになってしまいます。\n\n関数の組み合わせはほどほどに、表を作成する段階で、関数の組み合わせがいらないような設計をしましょう。\n\n# 関数の調べ方\n\nここまでに、いくつか関数を紹介してきましたが、実際にはもっと多くの関数が存在します。\n\nExcelではバージョンなどにもよりますが、400以上の関数があります。\n\nGoogle spreadsheetは、具体的な数が書いてある記事を見つけることはできませんでしたが、[Google スプレッドシートの関数リスト](https://support.google.com/docs/table/25273?hl=ja)に一覧が載っていて、これだけでもたくさんあるのがわかります。\n\nこれらを全て説明するのは、難しいですし、そもそも必要な関数だけをその都度調べて、使えるようにしておけば、問題ありません。\n\nそこで、関数の調べかたを最後に紹介します。関数の調べかたをマスターすると、おおよそ思いつくことの、ほとんどはできるようになるかと思います。\n\n## 表計算ソフト上で調べる\n\n表計算ソフトでは、関数を機能の種類ごとに一覧にしてあるので、そこから自分のやりたいことを探すことが出来ます。\n\n### google spreadsheetの場合\n\nメニューバーのΣ(シグマ)から関数の一覧を表示できます。その中から、使いたいものを選ぶだけで関数が入力されます。\n入力された段階で説明が表示されるので、その説明を読むことで、どのような関数なのか理解することが出来ます。\n\n###  Excelの場合\n\n左上あたりの$fx$と表記されたところをクリックすると右側にサイドバーガ表示され、関数の一覧が表示されます。\n関数をクリックすると説明が表示されるので、その説明を読むことで、どのような関数なのか理解することが出来ます。\n\nまた、関数を挿入をクリックすることで、選択中のセルに関数を挿入することが出来ます。\n\n## ウェブの検索を使用する\n\n関数について、説明しているサイトもたくさんあるので、googleなどの検索エンジンを使うのも良い方法です。\n`excel 検索 関数`というキーワードだけでVLOOKUP関数を検索することができるので、やりたいことが漠然としている時には、便利です。\n\n# まとめ\n\n今回は、google spreadsheetを通して表計算ソフトの使い方の基本を学んできました。\nたくさん紹介したので、この動画を見直して復習してみてください。\n\n前回も言いましたが、このようなソフトは「習うより慣れろ」です。\n説明を聞くより、いろいろ操作してみた方が、使いこなせるようになります。\nそれに、この動画だけでは、全ての機能を紹介することはできません。\nいろいろ触って操作してみて、学びを深めていってほしいです。","date":"2022/3/6 18:35:00","category":"over-the-fence","published":false}},"__N_SSG":true}